Repository: FlorianPB/ircbot
Catalog: locale/*.po
Languages: fr

source: Starting log
fr: Démarrage du journal

source: joined the channel
fr: a rejoint le canal

source: is now known as
fr: est maintenant connu sous le nom de

source: left the channel
fr: est parti du canal

source: (reason: %s)
fr: (raison: %s)

source: has quit
fr: est parti

source: * Mode %s defined for %s by
fr: * Mode %s défini pour %s par

source: * Mode %s defined on %s by
fr: * Mode %s défini pour %s par

source: NickServ password for
fr: Mot de passe NickServ pour

source: Registered command %s
fr: Commande %s enregistrée

source: %s have no right to run %s
fr: %s n'a pas le droit d'exécuter la commande %s

source: Sorry %s, you aren't authorized to do this.
fr: Désolé %s, tu n'es pas autorisé(e) à faire ça.

source: %s is a registered command ! Running it.
fr: %s est une commande enregistrée ! Exécution…

source: %s is not a registered command ! Sorry, I can't do anything. %s
fr: %s n'est pas une commande enregistrée ! Désolée, je ne peux rien faire. %s

source: Sorry %s, I can't find %s in my modules.
fr: Désolé %s, je ne trouve pas %s dans mes modules.

source: Sorry, we already are stopped !
fr: Désolé, je suis déjà stoppé !

source: Stopping the bot's irc connection
fr: Arrêt de la connexion à IRC

source: Sorry, we already are started !
fr: Désolé, je suis déjà démarré !

source: Loaded modules: %s
fr: Modules chargés: %s

source: Available commands: %s
fr: Commandes disponibles: %s

source: Cannot find help for module '%s'
fr: Impossible de trouver de l'aide pour '%s'

source: Help for command
fr: Aide pour la commande

source: Cannot find help for command '%s'
fr: Impossible de trouver de l'aide pour '%s'

source: Sorry, I have no valid channel to work with :/
fr: Désolé, je n'ai aucun canal valide :/

source: Sorry, please read @help.
fr: Désolé, veuillez lire @help.

source: launches a muffin on %s at %d km/h
fr: lance un muffin sur %s à %d km/h

source: This command is not restricted or does not exist.
fr: Cette commande n'est pas limitée ou n'existe pas.

source: Access is granted to this command to :
fr: Cette commande est maintenant autorisée pour :

source: This rule number is invalid for this command.
fr: Ce numéro de règle n'est pas valide pour cette commande.

source: Rule deleted.
fr: Règle supprimée.

source: No rule left, command is now unrestricted.
fr: Plus de règles actives, cette commande est maintenant non limitée.

source: Command was not restricted, registering it into the access list
fr: Cette commande n'était pas limitée, enregistrement dans la liste des commandes à accès limité

source: Rule(s) added.
fr: Règle(s) ajoutée(s).

source: Access rule edited.
fr: Règle d'accès éditée.

source: Sorry! Not enought parameters. See help.
fr: Désolé! Il n'y a pas assez de paramètres. Voir @help.

source: %s> Expression set for Trigger '%s'
fr: %s> Expression enregistrée pour le déclencheur '%s'

source: %s> Message added for Trigger '%s'
fr: %s> Message ajouté pour le déclencheur '%s'

source: Sorry! Subcommand %s unknown.
fr: Désolé! Sous-commande %s inconnue.

source: Loaded triggers:
fr: Déclencheurs chargés:

source: Expression for %s : %s
fr: Expression pour %s : %s

source: Please tell me who you want to talk to, and the message!
fr: Merci de me dire à qui le message est destiné, ainsi que le message accessoirement…

source: : Done.
fr: : Ça roule.

source: Master version: {v}, Current release: {r}, Commit ID: {c}
fr: Version de base: {v}, Release actuele: {r}, ID de commit: {c}

source: Master version: {v}, first release
fr: Version de base: {v}, première release

source: Sorry, git returned garbage. Please import the tags :(
fr: Désolée mais git me retourne de la merde. Il me manque les tags :(

source: Hey, I need some parameters!
fr: Heu… Avec des paramètres ce serait bien.

source: Error: the event date '{0}' is not in the right format ! (YYYY-mm-dd HH:MM)
fr: La date '{0}' est invalide ! Elle doit être au format AAAA-mm-jj HH:MM

source: Sorry, no upcoming event :/
fr: Pas d'event encore, désolée :/

source: Channel not specified!
fr: Canal non spécifié !

source: Sorry, you need to specify a channel in private mode
fr: Désolée, tu dois me fournir un nom de canal en discussion privée

source: Connecting socket to %s:%d
fr: Ouverture du socket vers %s:%d

source: Closing connection
fr: Fermeture de la connection

source: Got event line: %s
fr: Événement reçu: %s

source: Got pinged !
fr: Ping reçu !

source: Looking for hooks for registered event %s
fr: Recherche de fonctions associées à l'événement %s

source: Running hook function %s.%s against this event
fr: Exécution de la fonction %s.%s associée à cet événement

source: Loading %s…
fr: Chargement de %s…

source: Initializing module…
fr: Ouverture du module…
